Revit 2027 API
FillGrid.Origin Property
 Gets and sets the origin of the fill grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Origin { get; set; }
Public Property Origin As UV
	Get
	Set
public:
property UV^ Origin {
	UV^ get ();
	void set (UV^ value);
}
member Origin : UV with get, set
Property Value
UV
 The origin of the fill grid.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace